# Пользователь вводит две строки. В каждой из них есть какое-то количество специальных символов ! и ?.
# Напишите программу, которая считает количество этих символов отдельно в первой строке и отдельно во второй.
# Если в первой строке их больше, чем во второй, то на экран выводится первая строчка, объединённая со второй,
# а иначе — вторая с первой. При равном количестве символов в строках выводится «Ой».
first_message = input("Первое сообщение (должно содержать хотя бы один знак \"!\" или \"?\"): ")
second_message = input("Второе сообщение(должно содержать хотя бы один знак \"!\" или \"?\"): ")

if first_message.count("!") + first_message.count("?") > second_message.count("!") + second_message.count("?"):
	print("\nТретье сообщение:", first_message, second_message)
elif first_message.count("!") + first_message.count("?") < second_message.count("!") + second_message.count("?"):
	print("\nТретье сообщение:", second_message, first_message)
else:
	print("\nОй")